# SQL Chart

<img src="Books Core.png">

In [2]:
import pymysql
import pandas as pd
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [3]:
#connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Logan2010*" # (or whatever password you chose during mysql installation)
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [4]:
#Create Engine
engine = create_engine(connection)

In [5]:
#create new database that didn't exist
if database_exists(connection) == False:
    create_database(connection)
    print('Database created.')
else:
    print("The database already exists.")

The database already exists.

In [6]:
users = pd.read_csv("C://Users/16024/Desktop/Books Users.csv")

In [7]:
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
users.to_sql('users', engine, if_exists = 'replace')

3

In [9]:
books = pd.read_csv("C:/Users/16024/Desktop/Books Books.csv")

In [10]:
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [11]:
books.to_sql('books', engine, if_exists = 'replace')

6

In [12]:
authors = pd.read_csv("C:/Users/16024/Desktop/Books Authors.csv")

In [13]:
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [14]:
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [15]:
favorites = pd.read_csv("C:/Users/16024/Desktop/Books Favorites.csv")

In [16]:
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [17]:
favorites.to_sql("favorites", engine,if_exists = "replace")

7

In [18]:
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [19]:
q= """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""

In [20]:
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

In [22]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"